/**
 *  Copyright (c) 2009 - 2010 LOOKBACKON All rights reserved.
 */
package org.rcSpark.resManager.res
{
//--------------------------------------------------------------------------
//
//  Imports
//
//--------------------------------------------------------------------------
import flash.events.IEventDispatcher;

/****
 * SwfRes.as class. Created Aug 21, 2012 10:48:25 PM
 * <br>
 * Description:用来加载SWf文件
 * @author ryan
 * @langversion 3.0
 * @playerversion Flash 10
 ****/
public class SwfRes extends BaseRes
{
    //--------------------------------------------------------------------------
    //
    //  Variables
    //
    //--------------------------------------------------------------------------

    //--------------------------------------------------------------------------
    //
    //  Constructor
    //
    //--------------------------------------------------------------------------
    public function SwfRes(target:IEventDispatcher=null)
    {
        super(target);
    }

    //--------------------------------------------------------------------------
    //
    //  methods
    //
    //--------------------------------------------------------------------------

}

}